servicemix-soap/src/test/resources/org/apache/servicemix/soap/marshalers/soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<e:Envelope xmlns:e="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:wsa='http://schemas.xmlsoap.org/ws/2003/03/addressing'
  xmlns:d="http://www.w3.org/2001/XMLSchema"
  xmlns:i="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:wn0="http://systinet.com/xsd/SchemaTypes/"
  xmlns:wn1="http://systinet.com/wsdl/com/cexp/coe/bob/ws/customer/"
  xmlns:wn2="http://systinet.com/soap-jta/"
  xmlns:wn3="http://systinet.com/wsdl/com/cexp/coe/bob/services/order/pojo/"
  xmlns:test="uri:test">
  <e:Header>
    <wsa:To>http://test/MyConsumerService/myConsumer</wsa:To>
    <wsa:ReplyTo>
      <wsa:ServiceName>test:MyConsumerService</wsa:ServiceName>
    </wsa:ReplyTo>
  </e:Header>
  <e:Body>
    <wn1:getCustomerInfo>
      <wn1:userId i:type="d:string">akayali</wn1:userId>
    </wn1:getCustomerInfo>
  </e:Body>
</e:Envelope>
